packages/Webkul/Product/src/Repositories/ProductRepository.php

            }
        }

        return $filteredAttributeValues->first()?->product;
---
select * from `products` where `products`.`id` = 2133 limit 1

    public function getMaxPrice($params = [])
    {
        $customerGroup = $this->customerRepository->getCurrentGroup();

        $query = $this->model
            ->leftJoin('product_price_indices', 'products.id', 'product_price_indices.product_id')
            ->leftJoin('product_categories', 'products.id', 'product_categories.product_id')
            ->where('product_price_indices.customer_group_id', $customerGroup->id);

        if (! empty($params['category_id'])) {
            $query->where('product_categories.category_id', $params['category_id']);
        }

        return $query->max('min_price') ?? 0;
---
select max(`min_price`) as aggregate from `products` left join `product_price_indices` on `products`.`id` = `product_price_indices`.`product_id` left join `product_categories` on `products`.`id` = `product_categories`.`product_id` where `product_price_indices`.`customer_group_id` = 1